#pragma once
//==========================設計===================================
// 1.General_Event_Manager   
////玩家與視窗物件的互動  (除了Enemy與Tower之外的所有事)
//點選暫停、功能選單、開始引入Enemy、開啟技巧說明


// 2.Tower_Event_Manager
////玩家與塔的互動
//玩家滑鼠移動到塔的反應(顯示塔的性質、動畫效果)
//塔的建置、移除、升級
//塔可建置的位置(以方格空間表示)

// 3.Enemy_Event_Manager
//玩家滑鼠移到敵人位置，浮動顯示簡略資訊
//玩家滑鼠點選敵人時，下方說明欄顯示詳細資訊
//顯示敵人血條





//=================================================================




/**************************問題***********************************/
//Enemy內部運作要放進來??  例如每個關卡的Enemy配置
//

/*****************************************************************/

class General_Event_Manager {

};

class Enemy_Event_Manager {

};

class Tower_Event_Manager {

};