#pragma once
//==========================設計===================================
////引擎:SDL2
////遊戲介面、動畫效果



//=================================================================




/**************************問題***********************************/


/*****************************************************************/

//主畫面

//地圖

//塔

//城堡

//敵人進擊動畫

//Bullet攻擊動畫

//點選塔出現選單與說明 
	//塔的位置:升級資訊
	//下方說明欄:目前塔的屬性與下一等級的屬性

//游標摸到塔出現浮動的簡略屬性資訊

//游標移到敵人時顯示血條

//點選敵人時
	//敵人位置:出現血條
	//下方說明欄:出現詳細敵人屬性資料

//敵人進入城堡的動畫


